In [2]:
import pandas as pd

In [ ]:
y=df["Survived"]
x=df["Pclass","Sex","Age","SibSp","Parch","Fare","Cabin"]

In [3]:
df=pd.read_csv("C:/Users/athir/Downloads/train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [5]:
df.isnull().sum(axis="rows")

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df["Age"]=df["Age"].fillna(df["Age"].mean())
df.isnull().sum(axis="rows")

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
df=df.drop("Cabin",axis="columns")
df.isnull().sum(axis="rows")

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [8]:
df=df.drop("Embarked",axis="columns")
df.isnull().sum(axis="rows")

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
dtype: int64

In [12]:
y=df["Survived"]
x=df[["Pclass","Sex","Age","SibSp","Parch","Fare"]]

In [14]:
from keras.utils import to_categorical
y=to_categorical(y)

In [15]:
y.shape

(891, 2)

In [16]:
from keras.models import Sequential
from keras.layers import Dense

In [17]:
x.shape

(891, 6)

In [30]:
x=pd.get_dummies(x,columns=["Sex"])

In [32]:
model=Sequential()
model.add(Dense(50,activation="relu",input_shape=(7,)))
model.add(Dense(2,activation="softmax"))

In [38]:
model.compile(optimizer="adam",loss="categorical_crossentropy",metrics=["accuracy"])

In [40]:
model.fit(x,y,epochs=10)

Epoch 1/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4372 - accuracy: 0.8036
Epoch 2/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4358 - accuracy: 0.8002
Epoch 3/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4380 - accuracy: 0.8013
Epoch 4/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4404 - accuracy: 0.7957
Epoch 5/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4390 - accuracy: 0.8002
Epoch 6/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4356 - accuracy: 0.7912
Epoch 7/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4332 - accuracy: 0.8025
Epoch 8/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4394 - accuracy: 0.7935
Epoch 9/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4463 - accuracy: 0.7969
Epoch 10/10
28/28 [==============================] - 0s 2ms/step - loss: 0.4351 - accuracy: 0.7924

In [41]:
x

     Pclass        Age  SibSp  Parch     Fare  Sex_female  Sex_male
0         3  22.000000      1      0   7.2500           0         1
1         1  38.000000      1      0  71.2833           1         0
2         3  26.000000      0      0   7.9250           1         0
3         1  35.000000      1      0  53.1000           1         0
4         3  35.000000      0      0   8.0500           0         1
..      ...        ...    ...    ...      ...         ...       ...
886       2  27.000000      0      0  13.0000           0         1
887       1  19.000000      0      0  30.0000           1         0
888       3  29.699118      1      2  23.4500           1         0
889       1  26.000000      0      0  30.0000           0         1
890       3  32.000000      0      0   7.7500           0         1

[891 rows x 7 columns]

In [48]:
data=pd.DataFrame({"Pclass":[1],"Age":[22],"SibSp":[0], "Parch":[0],"Fare":[75],"Sex_female":[1],"Sex_male":[0]})
data

   Pclass  Age  SibSp  Parch  Fare  Sex_female  Sex_male
0       1   22      0      0    75           1         0

In [49]:
model.predict(data)

array([[0.02459113, 0.97540885]], dtype=float32)